# 1. Install SQLAlchemy

## Install from conda terminal

In [ ]:
# conda install -c anaconda sqlalchemy

## Install using pip

In [2]:
#%pip install SQLAlchemy

In [ ]:
# optional: get latest pre-release
# !pip install --pre SQLAlchemy

# 2. PyMySQL
### - database connectors for Python, libraries to enable Python programs to talk to a MySQL server

- Other databases will require other connectors.
- PostgreSQL - psycopg2
- Oracle - cx-Oracle
- Microsoft SQL - pyodbc

## pip install

In [4]:
#%pip install pymysql

## conda install - in terminal
`conda install pymysql`

# 3. Import packages

In [5]:
#!pip install cryptography

In [6]:
from sqlalchemy import create_engine # import connection
import pymysql # import connector

In [7]:
import configparser # reads the ini file

# 4. Create Engine

## 4.1 Directly
create the uri what it actually looks like

In [9]:
# uri based on your database credentials

uri_direct = 'mysql+pymysql://root:password@localhost:3306/loyalty'

In [10]:
# use sqlalchemy to create a connection engine

engine_direct = create_engine(uri_direct)

In [11]:
# this connects to the sql engine

con = engine_direct.connect()

## 4.2 Template - easier to edit

In [12]:
# Compiling login info
DB_TYPE = 'mysql'
DB_DRIVER = 'pymysql'
DB_USER = 'root' # your username in the mysql server
DB_PASS = 'password' # your password in the mysql server
DB_HOST = 'localhost' # change to hostname of your server if on cloud
DB_PORT = '3306' # change accordingly
DB_NAME = 'loyalty' # name of your database

MAKE THE CONNECTION:

In [16]:
SQLALCHEMY_DATABASE_URI = f'{DB_TYPE}+{DB_DRIVER}://{DB_USER}:{DB_PASS}@{DB_HOST}:{DB_PORT}/{DB_NAME}'
#SQLALCHEMY_DATABASE_URI = '{0}+{1}://{2}:{3}@{4}:{5}/{6}'.format(DB_TYPE,DB_DRIVER,DB_USER,DB_PASS,DB_HOST,DB_PORT,DB_NAME)

# Creating engine with login info
engine = create_engine(SQLALCHEMY_DATABASE_URI)
print(engine)
# this connects to the sql engine
con = engine.connect()

Engine(mysql+pymysql://root:***@localhost:3306/loyalty)

## Another way is using a config file

In [14]:
config = configparser.ConfigParser()
config.read('sql.ini')

['sql.ini']

In [15]:
# Compiling login info
DB_TYPE = config['default']['DB_TYPE']
DB_DRIVER = config['default']['DB_DRIVER']
DB_USER = config['default']['DB_USER']
DB_PASS = config['default']['DB_PASS']
DB_HOST = config['default']['DB_HOST']
DB_PORT = config['default']['DB_PORT']
DB_NAME = config['default']['DB_NAME']

## 5. Some Sample Commands

### Insert your SQL queries inside the execute() method as a string, followed by the fetchall() method to return the results

In [17]:
table_name = con.execute("SHOW DATABASES;").fetchall() # SQL code inside the execute() command
table_name

[('airbnb',),
 ('classicmodels',),
 ('company',),
 ('employees',),
 ('information_schema',),
 ('loyalty',),
 ('mysql',),
 ('performance_schema',),
 ('retail',),
 ('sakila',),
 ('superstore',),
 ('sys',),
 ('test',),
 ('university',),
 ('windowdb',)]

In [19]:
transation_10 = con.execute('''
    SELECT * 
    FROM loyalty.transactions
    LIMIT 10;
''').fetchall()

print(transation_10)

# return list of tuple
# not readable

[(9807, '83215400105', '-1', datetime.date(2015, 9, 9), Decimal('42.72'), '1', '198159807567120150909818'), (9807, '6024538816', '-1', datetime.date(2015, 10, 28), Decimal('27.57'), '1', '2171898075671201510281549'), (1396, '999999999999513', '139517343969', datetime.date(2015, 6, 18), Decimal('62.44'), '1', '60818613961182201506181635'), (9604, '999999999999513', '-1', datetime.date(2015, 12, 9), Decimal('0.00'), '1', '672879604118220151209919'), (9604, '999999999999513', '-1', datetime.date(2015, 12, 4), Decimal('0.00'), '1', '671159604118220151204726'), (1396, '999999999999513', '-1', datetime.date(2015, 10, 31), Decimal('7.32'), '1', '62208013961182201510311351'), (1396, '999999999999513', '-1', datetime.date(2015, 8, 11), Decimal('64.51'), '1', '61362813961182201508111206'), (9604, '999999999999513', '-1', datetime.date(2015, 11, 26), Decimal('0.00'), '1', '6676096041182201511261012'), (4823, '999999999999513', '134466064080', datetime.date(2015, 9, 15), Decimal('20.72'), '1', '3495148231182201509151324'), (9604, '999999999999513', '-1', datetime.date(2015, 11, 27), Decimal('0.00'), '1', '6681596041182201511271041')]

### Using SQL Alchemy with Pandas

In [20]:
import pandas as pd

transaction_first_10 = pd.read_sql('''
    SELECT * 
    FROM loyalty.transactions
    LIMIT 10;
''',con=con)

transaction_first_10

,store_location_key,product_key,collector_key,trans_dt,sales,units,trans_key
0,9807,83215400105,-1,2015-09-09,42.72,1,198159807567120150909818
1,9807,6024538816,-1,2015-10-28,27.57,1,2171898075671201510281549
2,1396,999999999999513,139517343969,2015-06-18,62.44,1,60818613961182201506181635
3,9604,999999999999513,-1,2015-12-09,0.00,1,672879604118220151209919
4,9604,999999999999513,-1,2015-12-04,0.00,1,671159604118220151204726
5,1396,999999999999513,-1,2015-10-31,7.32,1,62208013961182201510311351
6,1396,999999999999513,-1,2015-08-11,64.51,1,61362813961182201508111206
7,9604,999999999999513,-1,2015-11-26,0.00,1,6676096041182201511261012
8,4823,999999999999513,134466064080,2015-09-15,20.72,1,3495148231182201509151324
9,9604,999999999999513,-1,2015-11-27,0.00,1,6681596041182201511271041

## Write to SQL

In [21]:
df = pd.DataFrame({
    'name': ['User 1', 'User 2', 'User 3']
})
df

     name
0  User 1
1  User 2
2  User 3

In [22]:
df1 = pd.DataFrame({
    'name':['User 4', 'User 5']
})
df1

     name
0  User 4
1  User 5

In [23]:
df2 = pd.DataFrame({
    'name':['User 6', 'User 7']
})
df2

     name
0  User 6
1  User 7

In [24]:
df.to_sql('users', con = con)

In [27]:
con.execute('SELECT * FROM users').fetchall()

[(0, 'User 1'), (1, 'User 2'), (2, 'User 3'), (0, 'User 4'), (1, 'User 5')]

In [34]:
test_run = pd.read_sql('''
    SELECT * 
    FROM users
''',con=con)

test_run

   index    name
0      0  User 6
1      1  User 7

In [31]:
df1.to_sql('users', con=con, if_exists = 'append') # need to append if the table exists

In [35]:
df2.to_sql('users', con=con, if_exists = 'replace') # this will replace the entire table with the dataframe content

## remember to close the connection and then dispose engine

In [36]:
con.close()
engine.dispose()